
# this is ../me/mimi/chores/teaching/current/nlp/class_notes/homework/hw1.org


#+title: Homework 1:  Getting Started and the Structural Units of Language
#+author: Toni Kazic
#+date: Fall, 2023

# revised text of qs 31--34 <2021-08-25 Wed>
#
# revised text of qs 38 (bo-tagger) and 39 <2021-09-14 Tue>


#+SETUPFILE: "../../../common/preamble.org"
#+LATEX_CLASS: article
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil

#+LATEX_HEADER: \usepackage{langsci-avm}
# http://ftp.math.purdue.edu/mirrors/ctan.org/macros/latex/contrib/langsci-avm/langsci-avm.pdf

#+LATEX_HEADER: \newcommand{\grmr}[2]{\ensuremath{\mathrm{#1} & \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\txtgrmr}[2]{\ensuremath{\mathrm{#1} \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\grmrhs}[1]{\ensuremath{& \,\longrightarrow\, \mathrm{#1} }}
#+LATEX_HEADER: \newcommand{\wa}[1]{\type{\textnormal{\w{#1}}}}

# compile with pdflatex
#
# Kazic, 3.11.2020


# fixed question numbering on latex export, at the cost of removing line
# feeds and a little hard-wiring.
#
# It's possible to set the org-empty-line-terminates-plain-lists
#
# Kazic, 31.8.2021
#
# finally, cross-linking on list items!
# https://stackoverflow.com/questions/28151373/orgmode-referring-to-an-item-in-a-numbered-list
#
# Kazic, 1.9.2021


** 6 python/nltk questions


23.  [@23] What is the command to insert a python code block template?

24.  Load nltk and import the corpus using a python code block.

25.  How many unique tokens are in your corpus?
#+begin_src python :results output
from nltk.corpus import brown
print(len(set(brown.words())))
#+end_src

#+results:
: 56057
There are 56057 unique tokens in the entire corpus.


26.  Print out the first 1000 tokens in your corpus.

27.  Why do the tokens include punctuation?

28.  How many unique tokens are in the first 1000?
#+begin_src python :results output
from nltk.corpus import brown
print(len(set(brown.words()[:1000])))
#+end_src

#+results:
: 438
There are 438 unique tokens in the first 1000 tokens.





** 6 morpheme/morphosyntax/N-gram questions


29.  [@29] How many of each of the principal modal verbs occur in your corpus?

30.  How many unique bigrams are in your text?

# stopword caution
31.  How many bigrams contain the modal \w{can}?  Compute both for all and the
    unique bigrams.  Don't exclude stopwords!
#+begin_src python :results output
from nltk.corpus import brown
from nltk.util import bigrams
bigrams = list(bigrams(brown.words()))
count = 0
for bigram in bigrams:
  if bigram[0] == 'can' or bigram[1] == 'can':
    count = count + 1
print(count)
#+end_src

#+results:
: 3476
I counted 3476 bigrams containing the modal \w{can}.

# revised to insist on a prefix
# <<pref-regex>>
32.  <<pref-regex>> Choose a prefix from the list above and write a regular expression
    that identifies *all* words in your corpus containing that prefix
    (remember that a prefix begins the word).  What's the length of that
    group of words?
#+begin_src python :results output
from nltk.corpus import brown
import re

# I chose the prefix 'mega'
prefix_words = [s for s in brown.words() if re.search(r'^mega[a-zA-Z\-]', s)]
print(len(prefix_words))
print(len(set(prefix_words)))
#+end_src

#+results:
: 17
: 6
There are 17 words in the brown corpus that have the prefix
"mega". Counting only unique words, there are 6 in total.

# revised to specify what to show
# pref-regex
33.  <<sort-set>> Sort the set of problem [[pref-regex]] in alphabetical order (show your code and
    results) and study it.  Do you see multiple forms of the same headword?
    Show some examples.
#+begin_src python :results output
from nltk.corpus import brown
import re

# I chose the prefix "mega"
prefix_words = [s for s in brown.words() if re.search(r'^mega[a-zA-Z\-]', s)]

print(sorted(set(prefix_words)))
#+end_src

#+results:
: ['megakaryocytic', 'megalomania', 'megalopolises', 'megaton', 'megatons', 'megawatt']
The only repeated headwords I see are 'megaton' and the plural of it, 'megatons'.

# revised to specify what to show, changed back-pointer
# fixed back-pointer again
# pref-regex
34.  Now use the Porter stemmer on the set from problem [[sort-set]] (again, show
    your code and results).  What do you notice?
#+begin_src python :results output
from nltk.stem.porter import *
mega_prefixes = ['megakaryocytic', 'megalomania', 'megalopolises', 'megaton', 'megatons', 'megawatt']
stemmer = PorterStemmer()
stemmed_words = [stemmer.stem(w) for w in mega_prefixes]
print(stemmed_words)
print(len(set(stemmed_words)))
#+end_src

#+results:
: ['megakaryocyt', 'megalomania', 'megalopolis', 'megaton', 'megaton', 'megawatt']
: 5
The PorterStemmer removed the plurality of the word 'megatons' to produce
'megaton'. After this stemming, there are only 5 unique headwords that
start with the prefix 'mega'. 


** 8 Tags, Tagsets, and Tagging
SCHEDULED: <2023-09-26 Tue>

35.  [@35] Ask NLTK what tags the Penn Treebank tagset uses for nouns and verbs
    (and show the result).

#  <<ran-sent>> 



#+results:
: 19701

36. <<ran-sent>> Import the corpus and count the number of sentences in it, discarding
    any uninteresting front matter such as titles and chapter headings.
    Then show a random sentence.
#+begin_src python :results output
from nltk.corpus import brown
import random
sents = brown.sents()
num_sents = len(brown.sents())
#random_sentence_index = random.randint(0, num_sents)
# The random number I received from the above call was 19701, I will save the index for future problems.
random_sentence_index = 19701
print(sents[random_sentence_index])
#+end_src

#+results:
: ['By', 'counting', 'the', 'number', 'of', 'stalls', 'and', 'urinals', 'I', 'attempted', 'to', 'form', 'a', 'loose', 'estimate', 'of', 'how', 'many', 'men', 'the', 'hall', 'would', 'hold', 'at', 'one', 'time', '.']


37.  Tag each token in your random sentence as 'VB'.

#+begin_src python :results output

from nltk.corpus import brown
from nltk.tag import DefaultTagger
random_sentence_index = 19701
sents = brown.sents()
default_tagger = DefaultTagger('VB')
tagged_sentence = default_tagger.tag(sents[random_sentence_index])
print(tagged_sentence)
#+end_src

#+results:
: [('With', 'VB'), ('few', 'VB'), ('exceptions', 'VB'), (',', 'VB'), ('the', 'VB'), ('major', 'VB'), ('denominations', 'VB'), ('are', 'VB'), ('rapidly', 'VB'), ('losing', 'VB'), ('their', 'VB'), ('hold', 'VB'), ('on', 'VB'), ('the', 'VB'), ('central', 'VB'), ('city', 'VB'), ('.', 'VB')]

    # <<silly-tags>>
38. <<silly-tags>> Of course that's pretty silly, but we can make it even sillier.  Build
	a dictionary of the incorrectly tagged words in your sentence using the
	following tags:
#+begin_src python
silly = ['FOO','BAR','EGO','NEED','ADS','DUCK','MANSE'
#+end_src
#  [[ran-sent]]


39. [@39]  <<bo-tagger>> Construct a lookup tagger trained on the 1000 most frequent words in
    the Brown news category that backs off to a default tag of 'UNK'.  Use
    that to tag the original random sentence you got in question [[ran-sent]].  Print
    the result as the list of tuples in sentence order.  What do you
    observe?
#+begin_src python :results output
import nltk
from nltk.corpus import brown
freq_dist = nltk.FreqDist(brown.words(categories='news'))
cond_freq_dist = nltk.ConditionalFreqDist(brown.tagged_words(categories='news'))
most_freq_words = freq_dist.most_common(1000)
freq_tags = dict((word, cond_freq_dist[word].max()) for (word, _) in most_freq_words)
botagger = nltk.UnigramTagger(model=freq_tags, backoff=nltk.DefaultTagger('UNK'))
sents = brown.sents()
print(botagger.tag(sents[19701]))
#+end_src

#+results:
: [('With', 'IN'), ('few', 'AP'), ('exceptions', 'UNK'), (',', ','), ('the', 'AT'), ('major', 'JJ'), ('denominations', 'UNK'), ('are', 'BER'), ('rapidly', 'UNK'), ('losing', 'UNK'), ('their', 'PP$'), ('hold', 'UNK'), ('on', 'IN'), ('the', 'AT'), ('central', 'JJ'), ('city', 'NN'), ('.', '.')]
The bo-tagger seems to be able to tag at least half of the sentence. The more common words are definitely the ones getting tagged, whereas
more uncommon words such as 'denominations' are being tagged 'UNK'.


#  ran-sent and bo-tagger
40. [@40] For your random sentence found in question [[ran-sent]] tagged with
    the tagger you built in question [[bo-tagger]], write a
    transformational rule the Brill tagger might discover for the each of
    the first three UNK tags.  Put these in an example block as ordinary
    text, /e.g./:
#+BEGIN_EXAMPLE
tagged sentence
rule 1: If the preceding word is 'few':  UNK -> NN
rule 2: If the preceding word is 'JJ' (an adjective): UNK -> NN
rule 3: If the word i-1 is 'are' and word i+1 is 'VB', 'RB', or 'UNK': UNK -> RB
#+END_EXAMPLE



This problem relies on a problem my team members were responsible for, and
they did not complete nor ask for help until right before the homework deadline.
# <<to-gram>>
41. [@41]  <<to-gram>> Example 2.2 in [[http://www.nltk.org/book/ch07.html][chapter 7]] shows a little grammar for noun phrase
    chunking.  Let's mix it up a bit and define a grammar for "to phrases":
    bigrams that begin with the tag =TO=.  Show the total parse and just
    the "to phrases" (just edit away the rest unless you feel like getting
    fancy). Use the following sentence to build and test your grammar:
#+begin_src python

# more convenient one-liner
tj = [('He', 'PPS'), ('had', 'HVD'), ('nothing', 'UNK'), ('to', 'TO'), ('urge', 'UNK'), ('against', 'IN'), ('it', 'PPS'), (',', ','), ('but', 'CC'), ('still', 'RB'), ('resisted', 'UNK'), ('the', 'AT'), ('idea', 'UNK'), ('of', 'IN'), ('a', 'AT'), ('letter', 'UNK'), ('of', 'IN'), ('proper', 'UNK'), ('submission', 'UNK'), (';', '.'), ('and', 'CC'), ('therefore', 'UNK'), (',', ','), ('to', 'TO'), ('make', 'VB'), ('it', 'PPS'), ('easier', 'UNK'), ('to', 'TO'), ('him', 'PPO'), (',', ','), ('as', 'CS'), ('he', 'PPS'), ('declared', 'VBD'), ('a', 'AT'), ('much', 'AP'), ('greater', 'UNK'), ('willingness', 'UNK'), ('to', 'TO'), ('make', 'VB'), ('mean', 'UNK'), ('concessions', 'UNK'), ('by', 'IN'), ('word', 'NN'), ('of', 'IN'), ('mouth', 'UNK'), ('than', 'IN'), ('on', 'IN'), ('paper', 'UNK'), (',', ','), ('it', 'PPS'), ('was', 'BEDZ'), ('resolved', 'UNK'), ('that', 'CS'), (',', ','), ('instead', 'UNK'), ('of', 'IN'), ('writing', 'UNK'), ('to', 'TO'), ('Fanny', 'UNK'), (',', ','), ('he', 'PPS'), ('should', 'MD'), ('go', 'VB'), ('to', 'TO'), ('London', 'UNK'), (',', ','), ('and', 'CC'), ('personally', 'UNK'), ('intreat', 'UNK'), ('her', 'PP$'), ('good', 'JJ'), ('offices', 'UNK'), ('in', 'IN'), ('his', 'PP$'), ('favour', 'UNK'), ('.--', 'UNK'), ('"', 'UNK'), ('And', 'CC'), ('if', 'CS'), ('they', 'PPSS'), ('really', 'RB'), ('DO', 'UNK'), ('interest', 'NN'), ('themselves', 'PPLS'), (',"', 'UNK'), ('said', 'VBD'), ('Marianne', 'UNK'), (',', ','), ('in', 'IN'), ('her', 'PP$'), ('new', 'JJ'), ('character', 'UNK'), ('of', 'IN'), ('candour', 'UNK'), (',', ','), ('"', 'UNK'), ('in', 'IN'), ('bringing', 'UNK'), ('about', 'IN'), ('a', 'AT'), ('reconciliation', 'UNK'), (',', ','), ('I', 'PPSS'), ('shall', 'UNK'), ('think', 'VB'), ('that', 'CS'), ('even', 'RB'), ('John', 'NP'), ('and', 'CC'), ('Fanny', 'UNK'), ('are', 'BER'), ('not', '*'), ('entirely', 'UNK'), ('without', 'IN'), ('merit', 'UNK'), ('."', 'UNK')]

# for prettier printing

tj = [('He', 'PPS'), ('had', 'HVD'), ('nothing', 'UNK'), ('to', 'TO'), ('urge', 'UNK'), 
      ('against', 'IN'), ('it', 'PPS'), (',', ','), ('but', 'CC'), ('still', 'RB'), 
      ('resisted', 'UNK'), ('the', 'AT'), ('idea', 'UNK'), ('of', 'IN'), ('a', 'AT'), 
      ('letter', 'UNK'), ('of', 'IN'), ('proper', 'UNK'), ('submission', 'UNK'), (';', '.'), 
      ('and', 'CC'), ('therefore', 'UNK'), (',', ','), ('to', 'TO'), ('make', 'VB'), 
      ('it', 'PPS'), ('easier', 'UNK'), ('to', 'TO'), ('him', 'PPO'), (',', ','), 
      ('as', 'CS'), ('he', 'PPS'), ('declared', 'VBD'), ('a', 'AT'), ('much', 'AP'), 
      ('greater', 'UNK'), ('willingness', 'UNK'), ('to', 'TO'), ('make', 'VB'), 
      ('mean', 'UNK'), ('concessions', 'UNK'), ('by', 'IN'), ('word', 'NN'), ('of', 'IN'), 
      ('mouth', 'UNK'), ('than', 'IN'), ('on', 'IN'), ('paper', 'UNK'), (',', ','), ('it', 'PPS'), 
      ('was', 'BEDZ'), ('resolved', 'UNK'), ('that', 'CS'), (',', ','), 
      ('instead', 'UNK'), ('of', 'IN'), ('writing', 'UNK'), ('to', 'TO'), 
      ('Fanny', 'UNK'), (',', ','), ('he', 'PPS'), ('should', 'MD'), ('go', 'VB'), 
      ('to', 'TO'), ('London', 'UNK'), (',', ','), ('and', 'CC'), ('personally', 'UNK'), 
      ('intreat', 'UNK'), ('her', 'PP$'), ('good', 'JJ'), ('offices', 'UNK'), ('in', 'IN'), 
      ('his', 'PP$'), ('favour', 'UNK'), ('.--', 'UNK'), ('"', 'UNK'), ('And', 'CC'), 
      ('if', 'CS'), ('they', 'PPSS'), ('really', 'RB'), ('DO', 'UNK'), ('interest', 'NN'), 
      ('themselves', 'PPLS'), (',"', 'UNK'), ('said', 'VBD'), ('Marianne', 'UNK'), 
      (',', ','), ('in', 'IN'), ('her', 'PP$'), ('new', 'JJ'), ('character', 'UNK'), 
      ('of', 'IN'), ('candour', 'UNK'), (',', ','), ('"', 'UNK'), ('in', 'IN'), 
      ('bringing', 'UNK'), ('about', 'IN'), ('a', 'AT'), ('reconciliation', 'UNK'), 
      (',', ','), ('I', 'PPSS'), ('shall', 'UNK'), ('think', 'VB'), ('that', 'CS'), 
      ('even', 'RB'), ('John', 'NP'), ('and', 'CC'), ('Fanny', 'UNK'), ('are', 'BER'), 
      ('not', '*'), ('entirely', 'UNK'), ('without', 'IN'), ('merit', 'UNK'), ('."', 'UNK')]
#+end_src

#  [[to-gram]], 40
42.  [@42] What do you observe in your results for question [[to-gram]]?  Why do you think
    this is happening?




* Scoring




|     question | ok? |
|--------------+-----|
|            1 |     |
|            2 |     |
|            3 |     |
|            4 |     |
|            5 |     |
|            6 |     |
|            7 |     |
|            8 |     |
|            9 |     |
|           10 |     |
|           11 |     |
|           12 |     |
|           13 |     |
|           14 |     |
|           15 |     |
|           16 |     |
|           17 |     |
|           18 |     |
|           19 |     |
|           20 |     |
|           21 |     |
|           22 |     |
|           23 |     |
|           24 |     |
|           25 |     |
|           26 |     |
|           27 |     |
|           28 |     |
|           29 |     |
|           30 |     |
|           31 |     |
|           32 |     |
|           33 |     |
|           34 |     |
|           35 |     |
|           36 |     |
|           37 |     |
|           38 |     |
|           39 |     |
|           40 |     |
|           41 |     |
|           42 |   0 |
|--------------+-----|
|  total score |   0 |
|     fraction |   0 |
| total points |     |
#+TBLFM: @44$2=vsum(@I..@II)::@45$2=@-1/(@-2$1)

